In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price': [200, 150, 300, 250, 180, 320]
})

In [3]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [10]:
mean_price = df.groupby("city")["price"].mean().to_dict()

In [12]:
df['city_encoded']=df["city"].map(mean_price)
df[["city_encoded","price"]]

   city_encoded  price
0         190.0    200
1         150.0    150
2         310.0    300
3         250.0    250
4         190.0    180
5         310.0    320